БухЭксп/InformationRegisters/Отчетность24БРОПодключения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Отчетность24БРОПодключения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьПодтверждениеПользователя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Госорганы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/Отчетность24БРООграниченияПоОрганизациям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Отчетность24БРООграниченияПоОрганизациям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/Отчетность24БРОНастройкиПодтверждения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Отчетность24БРОНастройкиПодтверждения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РазрешеноПодтверждениеОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пользователь</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/CommonModules/ИнтеграцияСОтчетность24ВызовСервера/Ext/Module.bsl
// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Подключиться.
// 
// Параметры:
//  КодовоеСлово - Строка
//  Ошибка       - Строка
// 
// Возвращаемое значение:
//  Структура:
// * Состояние      - Число 
// * ТекстСостояния - Строка 
Функция Подключиться(КодовоеСлово, Ошибка = "") Экспорт
	
	Результат = Новый Структура("Состояние, ТекстСостояния", 0, "");
	
	Если ЗначениеЗаполнено(КодовоеСлово) = Ложь Тогда
		Результат.Вставить("Состояние", 2);
		Результат.Вставить("ТекстСостояния", НСтр("ru='Не введен пин-код'"));
		Возврат Результат;
	КонецЕсли;
	
	АдресаШины = Отчетность24БРО.АдресаШины();
	
	ОписаниеОшибки = "";
	Соединение = ИнтеграцияСОтчетность24.
		УстановитьСоединениеССерверомИнтернета(АдресаШины.Сервер, ОписаниеОшибки);
	
	Если Соединение <> Неопределено Тогда
		
		РезультатПолученияТикета = ТикетАутентификацииНаПорталеПоддержки();
		Если РезультатПолученияТикета = Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РезультатПолученияТикета.Тикет) = Ложь Тогда
			Ошибка = НСтр("ru='Сначала необходимо указать логин и пароль ИТС'");
			Результат.Вставить("Состояние", 4);
			Результат.Вставить("ТекстСостояния", Ошибка);
			Возврат Результат;
		Иначе
			ЗапросHttp = Новый HTTPЗапрос;
			ЗапросHttp.Заголовки.Вставить(НРег("TicketITS"), РезультатПолученияТикета.Тикет);
			ЗапросHttp.Заголовки.Вставить(НРег("TicketControl"), 
				ИнтеграцияСОтчетность24.КонтрольнаяСуммаТикетаИТС(РезультатПолученияТикета.Тикет));
			ЗапросHttp.АдресРесурса = АдресаШины.Подключение;
			
			Тело = ИнтеграцияСОтчетность24.ПараметрыБазыДанных();
			Тело.Вставить("КодовоеСлово", КодовоеСлово);
			
			ЗапросHttp.УстановитьТелоИзСтроки(Отчетность24БРОСериализация.ЗначениеВJSON(Тело));
			
			Попытка
				Ответ = Соединение.ВызватьHTTPМетод("GET", ЗапросHttp);
			Исключение
				Ошибка = НСтр("ru='Не удалось получить сообщение в сервисе 1С-Отчетность'");
			КонецПопытки;

			Если ТипЗнч(Ответ) = Тип("HTTPОтвет") Тогда

				Если Ответ.КодСостояния = 200 Тогда
					ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
					ДанныеОтвета = Отчетность24БРОСериализация.JSONВЗначение(ТекстОтвета);

					Инициатор = ДанныеОтвета.Получить("Инициатор");
					АдресИнициатора = ДанныеОтвета.Получить("АдресИнициатора");
					ИсточникДанных = ДанныеОтвета.Получить("ИсточникДанных");
					ИсточникДанныхИд = ДанныеОтвета.Получить("ИсточникДанныхИд"); // Строка
					ИсточникДанныхСекрет = ДанныеОтвета.Получить("ИсточникДанныхСекрет"); // Строка
					ИмяИнициатора = ДанныеОтвета.Получить("ИмяИнициатора");
					Организации = ДанныеОтвета.Получить("Организации"); // Строка - Строка JSON

					Результат.Вставить("Получатель", Инициатор);
					Результат.Вставить("Отправитель", ИсточникДанных);
					Результат.Вставить("Имя", ИмяИнициатора);
					Результат.Вставить("АдресПолучателя", АдресИнициатора);
					Результат.Вставить("Организации", Отчетность24БРОСериализация.JSONВЗначение(Организации));

					ПривилегированныйРежим = ПривилегированныйРежим();
					Если Не ПривилегированныйРежим Тогда
						УстановитьПривилегированныйРежим(Истина);
					КонецЕсли;
					Константы.КлиентШиныОтчетности.Установить(ИсточникДанныхИд);
					Константы.СекретШиныОтчетности.Установить(ИсточникДанныхСекрет);
					Если Не ПривилегированныйРежим Тогда
						УстановитьПривилегированныйРежим(Ложь);
					КонецЕсли;

					Ошибка = "";
				ИначеЕсли Ответ.КодСостояния = 419 Тогда
					Ошибка = НСтр("ru='Пин-код просрочен, запросите новый'");
				ИначеЕсли Ответ.КодСостояния = 403 Тогда
					Ошибка = НСтр("ru='Пин-код не верный'");
				Иначе
					Ошибка = НСтр("ru='Ошибка на сервере'");
					ИнтеграцияСОтчетность24.ЗаписатьОшибкуСервераВЖурналРегистрации(Ответ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Ошибка = ОписаниеОшибки;
	КонецЕсли;
	
	ИмяСвойстваПолучатель = "Получатель";
	Если ЗначениеЗаполнено(Ошибка) Тогда
		Результат.Вставить("Состояние", 2);
		Результат.Вставить("ТекстСостояния", Ошибка);
	ИначеЕсли Результат.Свойство(ИмяСвойстваПолучатель) Тогда

		Запись = РегистрыСведений.Отчетность24БРОПодключения.СоздатьМенеджерЗаписи();
		Запись.Получатель = Строка(Результат[ИмяСвойстваПолучатель]);
		Запись.Прочитать();
		ЗаполнитьЗначенияСвойств(Запись, Результат);
		
		Если Запись.Выбран() Тогда
			Результат.Вставить("Состояние", 3);
			Результат.Вставить("ТекстСостояния", "Подключено ранее");
		Иначе
			Результат.Вставить("Состояние", 1);
			Результат.Вставить("ТекстСостояния", "Подключено");
			Запись.ТребоватьПодтверждениеПользователя = Истина;
		КонецЕсли;
		Запись.Записать();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Представление гиперссылки организации настроек.
// 
// Параметры:
//  Получатель - Строка
// 
// Возвращаемое значение:
//  Строка
Функция ПредставлениеГиперссылкиОрганизацииНастроек(Получатель) Экспорт
	
	Результат = "<Не выбрано>";
	
	Запрос = Новый Запрос;   
	Запрос.УстановитьПараметр("Получатель", Получатель);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ОграничениеПередачиДанныхВОблачнуюОтчетность.Организация КАК Организация
	               |ИЗ
	               |	РегистрСведений.Отчетность24БРООграниченияПоОрганизациям КАК ОграничениеПередачиДанныхВОблачнуюОтчетность
	               |ГДЕ
	               |	ОграничениеПередачиДанныхВОблачнуюОтчетность.Получатель = &Получатель";
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();   
	УстановитьПривилегированныйРежим(Ложь);
	Если РезультатЗапроса.Пустой() Тогда
		Результат = "Все организации";
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Количество() > 1 Тогда
			Результат = ПолучитьСклоненияСтрокиПоЧислу("", Выборка.Количество(), 
				"организация", "Л=ru_RU; ЧС=Количественное", "ПД=Именительный")[0]
		Иначе
			Выборка.Следующий();
			ИмяКолонкиОрганизация = "Организация";
			Результат = Строка(Выборка[ИмяКолонкиОрганизация]);
		КонецЕсли;
	КонецЕсли;   
	
	Возврат Результат;
	
КонецФункции

// Представление гиперссылки пользователи настроек.
// 
// Параметры:
//  Получатель - Строка
// 
// Возвращаемое значение:
//  Строка 
Функция ПредставлениеГиперссылкиПользователиНастроек(Получатель) Экспорт  
	
	Результат = "<Не выбрано>";
	
	Запрос = Новый Запрос;   
	Запрос.УстановитьПараметр("Получатель", Получатель);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	НастройкиПодтвержденияПередачиДанныхВОблачнуюОтчетность.Пользователь КАК Пользователь
	               |ИЗ
	               |	РегистрСведений.Отчетность24БРОНастройкиПодтверждения КАК НастройкиПодтвержденияПередачиДанныхВОблачнуюОтчетность
	               |ГДЕ
	               |	НастройкиПодтвержденияПередачиДанныхВОблачнуюОтчетность.Получатель = &Получатель
	               |	И НастройкиПодтвержденияПередачиДанныхВОблачнуюОтчетность.РазрешеноПодтверждениеОтправки";
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();   
	УстановитьПривилегированныйРежим(Ложь);
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать(); 
		Количество = 0;     
		ЕстьТекущий = Ложь; 
		ПредставлениеПервого = "";
		ТекущийПользователь = Пользователи.ТекущийПользователь();
		ИмяКолонкиПользователь = "Пользователь";
		Пока Выборка.Следующий() Цикл
			Количество = Количество + 1;
			Если ЕстьТекущий = Ложь И Выборка[ИмяКолонкиПользователь] = ТекущийПользователь Тогда
				ЕстьТекущий = Истина;	
			КонецЕсли;  
			Если Количество = 1 Тогда
				ПредставлениеПервого = Строка(Выборка[ИмяКолонкиПользователь]);
			КонецЕсли;
		КонецЦикла;
		Если Количество = 1 Тогда
			Если ЕстьТекущий Тогда
				Результат = "Только Вы";
			Иначе
				Результат = ПредставлениеПервого;
			КонецЕсли;
		Иначе              
			СклонениеКоличества = ПолучитьСклоненияСтрокиПоЧислу("", 
				?(ЕстьТекущий, Количество - 1, Количество), 
				"пользователь", "Л=ru_RU; ЧС=Количественное", "ПД=Именительный")[0];
			Результат = ?(ЕстьТекущий, "Вы и еще ", "") + СклонениеКоличества; 
		КонецЕсли;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции 

// Индекс наименования настройки.
// 
// Параметры:
//  Имя        - Строка
//  Получатель - Строка
// 
// Возвращаемое значение:
//  Строка - Индекс наименования настройки
Функция ИндексНаименованияНастройки(Имя, Получатель) Экспорт  
	
	МассивЧастей = СтрРазделить(Имя, "(");
	Если МассивЧастей.Количество() > 1 И СтрЗаканчиваетсяНа(СокрЛП(Имя), ")") Тогда   
		ИндексТекущий = МассивЧастей[МассивЧастей.ВГраница()];
		ИндексТекущий = Лев(ИндексТекущий, СтрДлина(ИндексТекущий) - 1);
		Для ИндексСимвола = 1 По СтрДлина(ИндексТекущий) Цикл
			Если СтрНайти("0123456789", Сред(ИндексТекущий, ИндексСимвола, 1)) = 0 Тогда    
				ИндексТекущий = "";
				Прервать;	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(ИндексТекущий) Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Имя", Имя);
	Запрос.УстановитьПараметр("Получатель", Получатель);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Отчетность24Подключения.Имя КАК Имя
	               |ИЗ
	               |	РегистрСведений.Отчетность24БРОПодключения КАК Отчетность24Подключения
	               |ГДЕ
	               |	Отчетность24Подключения.Имя ПОДОБНО &Имя + ""%""
	               |	И Отчетность24Подключения.Получатель <> &Получатель";
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();   
	УстановитьПривилегированныйРежим(Ложь);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Возврат " (" + Строка(Выборка.Количество() + 1) + ")";
	КонецЕсли;
	
КонецФункции     

// Тикет аутентификации на портале поддержки.
// 
// Возвращаемое значение:
//  см. Отчетность24БРО.ТикетАутентификацииНаПорталеПоддержки
Функция ТикетАутентификацииНаПорталеПоддержки() Экспорт
	
	Возврат Отчетность24БРО.ТикетАутентификацииНаПорталеПоддержки();
	
КонецФункции 

//См. ИнтеграцияСОтчетность24.РазрешеноПодтверждениеОтправкиДанныхОтчетов
Функция РазрешеноПодтверждениеОтправкиДанныхОтчетов() Экспорт
	
	Возврат ИнтеграцияСОтчетность24.РазрешеноПодтверждениеОтправкиДанныхОтчетов();

КонецФункции

// Заполняет методы под требование безопасности
// 
// Параметры:
//  Методы - Структура - СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
    Методы.Вставить("ПолучитьСообщенияПоHttp");
КонецПроцедуры

Процедура ПолучитьСообщенияПоHttp(ОписаниеОшибки = "", ВыполнитьВФоне = Истина) Экспорт
	
	Если ВыполнитьВФоне Тогда
		ОтборЗаданий = Новый Структура();
		ОтборЗаданий.Вставить("ИмяМетода", "ИнтеграцияСОтчетность24.ПолучитьСообщенияПоHttp");
		ОтборЗаданий.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
		АктивныеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборЗаданий);
		
		Если АктивныеЗадания.Количество()>0 Тогда
			Возврат;
		КонецЕсли;
		
		ФоновыеЗадания.Выполнить("ИнтеграцияСОтчетность24.ПолучитьСообщенияПоHttp", , "", 
		"Получение сообщений из шины отчетности");
	Иначе
		ИнтеграцияСОтчетность24.ПолучитьСообщенияПоHttp(ОписаниеОшибки);
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработатьОтложенныеЗапросы() Экспорт
	ИнтеграцияСОтчетность24.ОбработатьОтложенныеЗапросы();
КонецПроцедуры

// См. ИнтеграцияСОтчетность24.ПолучитьЗапросыИнтеграцииДляФормыПодтверждения
Функция ПолучитьЗапросыИнтеграцииДляФормыПодтверждения() Экспорт 
	
	Возврат ИнтеграцияСОтчетность24.ПолучитьЗапросыИнтеграцииДляФормыПодтверждения();
	
КонецФункции

Функция ЕстьНастроенныеИнтеграции() Экспорт 

	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ Первые 1
		|	Отчетность24Подключения.Получатель КАК Получатель
		|ИЗ
		|	РегистрСведений.Отчетность24БРОПодключения КАК Отчетность24Подключения";
		
		УстановитьПривилегированныйРежим(Истина);
		Возврат Не Запрос.Выполнить().Пустой();
		
	Исключение
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

#Область ПодключениеКШинеОтчетности

// Подключается к приложению Отчетность по пин-коду и сохраняет настройки подключения
// В отличие от Подключиться не требует интерактивной формы записи регистра настроек
// и пригодна для тихого подключения при первичной загрузке справочников
//
// Параметры:
//  КодовоеСлово - Строка - пин-код, выданный приложением Отчетность
//  Ошибка - Строка - текст ошибки подключения
//
// Возвращаемое значение:
//  см. Подключиться
//
Функция ПодключитьсяИСохранитьНастройки(КодовоеСлово, Ошибка = "") Экспорт

	Результат = Подключиться(КодовоеСлово, Ошибка);

	Состояние = 0;
	Если Результат.Свойство("Состояние", Состояние) И (Состояние = 1 Или Состояние = 3) Тогда
		ИнтеграцияСОтчетность24.СохранитьНастройкиПодключения(Результат);
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Подключает учетную базу к приложению 1С-Отчетность 24 по параметру запуска
//
// Параметры:
//  ПараметрЗапуска - Строка - параметр запуска приложения
//
// Возвращаемое значение:
//  Строка - текст ошибки, пустая строка если база подключена
//
Функция ПодключитьУчетнуюБазуВФоне(ПараметрЗапуска) Экспорт

	Возврат Обработки.ПереносСправочниковБРО.ПодключитьУчетнуюБазуВФоне(ПараметрЗапуска);

КонецФункции

// Проверяет право текущего пользователя на перенос справочников в приложение 1С-Отчетность 24
// Перенос читает и записывает данные всех организаций, поэтому доступен только полноправному пользователю
//
// Возвращаемое значение:
//  Булево - Истина если у пользователя полные права
//
Функция ЕстьПраваНаПереносСправочников() Экспорт

	Возврат Пользователи.ЭтоПолноправныйПользователь();

КонецФункции

#КонецОбласти

#КонецОбласти
